Revit 2024 API
Category.GetBuiltInCategory Method
 Gets the BuiltInCategory value corresponding to the given built-in category identifier.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2022
Syntax
C#
public static BuiltInCategory GetBuiltInCategory(
	ForgeTypeId categoryTypeId
)
Visual Basic
Public Shared Function GetBuiltInCategory ( _
	categoryTypeId As ForgeTypeId _
) As BuiltInCategory
Visual C++
public:
static BuiltInCategory GetBuiltInCategory(
	ForgeTypeId^ categoryTypeId
)
Parameters
categoryTypeId
Type: Autodesk.Revit.DB.ForgeTypeId
 The built-in category identifier.
Return Value
 The BuiltInCategory value corresponding to the given built-in category identifier.
Remarks
 A ForgeTypeId identifies a built-in category if it corresponds to a valid BuiltInCategory value according to Category.IsBuiltInCategory(ForgeTypeId) and Category.GetBuiltInCategoryTypeId(BuiltInCategory).
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  categoryTypeId is not a built-in category identifier. See Category.IsBuiltInCategory(ForgeTypeId) and Category.GetBuiltInCategoryTypeId(BuiltInCategory).
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
Category Class
Autodesk.Revit.DB Namespace